import os

from gtts import gTTS

# Woordenlijst met Arabische woorden
arabic_words = [
    "بِسْمِ", "اللَّهِ", "الرَّحْمٰنِ", "الرَّحِيْمِ", "الْحَمْدُ", "رَبِّ", "الْعَالَمِينَ",
    "الرَّحْمٰنِ", "الرَّحِيْمِ", "مَالِكِ", "يَوْمِ", "الدِّينِ", "إِيَّاكَ", "نَعْبُدُ",
    "وَإِيَّاكَ", "نَسْتَعِينُ", "اهْدِنَا", "الصِّرَاطَ", "الْمُسْتَقِيمَ", "صِرَاطَ", "الَّذِينَ",
    "أَنْعَمْتَ", "عَلَيْهِمْ", "غَيْرِ", "الْمَغْضُوبِ", "وَلَا", "الضَّالِّينَ", "آمِين",
    "الْمُؤْمِنُونَ", "الْإِسْلَامُ", "التَّوْحِيدُ", "الْإِحْسَانُ", "النَّبِيُّ", "الرَّسُولُ",
    "الْكِتَابُ", "الدُّنْيَا", "الْآخِرَةُ", "الْجَنَّةُ", "النَّارُ", "الْإِيمَانُ", "الصَّلَاةُ",
    "الزَّكَاةُ", "الصِّيَامُ", "الْحَجُّ", "الطَّيِّبُ", "الْخَبِيثُ", "الْحَقُّ", "الْبَاطِلُ",
    "الْقُرْآنُ", "الْحَدِيثُ", "الذِّكْرُ", "الدُّعَاءُ", "الصَّبْرُ", "الرِّزْقُ", "الْبَرَكَةُ",
    "الْفَضْلُ", "الْكَرَمُ", "الْعَدْلُ", "الظُّلْمُ", "الْمَوْتُ", "الْحَيَاةُ", "الْمَاءُ",
    "الْقَلْبُ", "الْعَقْلُ", "النَّفْسُ", "الْوَجْهُ", "الْعَيْنُ", "الْأُذُنُ", "اللِّسَانُ",
    "الْيَدُ", "الرِّجْلُ", "الطَّعَامُ", "الشَّرَابُ", "الْمَسْجِدُ", "الْمَدِينَةُ", "الْبَيْتُ",
    "الْأَهْلُ", "الْوَالِدُ", "الْوَالِدَةُ", "الْإِبْنُ", "الْبِنْتُ", "الأَخُ", "الأُخْتُ",
    "الصَّدِيقُ", "الْمُسْلِمُ", "الْمُؤْمِنُ", "الْمُنَافِقُ", "الْكَافِرُ", "الْعَالِمُ", "الْجَاهِلُ",
    "الْفَاسِقُ", "الشَّيْطَانُ", "الْمَلَائِكَةُ", "الْجِنُّ", "الْإِنْسَانُ", "الْخَلْقُ", "الْرَّبُّ",
    "الْإِبْلِيسُ", "الْيَوْمُ", "اللَّيْلُ", "النَّهَارُ", "الشَّمْسُ", "الْقَمَرُ", "النُّجُومُ",
    "الْغَيْثُ", "الْبَحْرُ", "النَّهْرُ", "الْجِبَالُ", "السَّمَاءُ", "الأَرْضُ", "الزَّرْعُ",
    "الشَّجَرُ", "الثَّمَرُ", "الحَيَوَانُ"
]


# Zorg ervoor dat de 'sounds' map bestaat
if not os.path.exists("sounds"):
    os.makedirs("sounds")

# Genereer en sla MP3-bestanden op
for word in arabic_words:
    tts = gTTS(text=word, lang='ar')
    filename = os.path.join("sounds", f"{word}.mp3")
    tts.save(filename)
    print(f"Opgeslagen: {filename}")
